import React from 'react'
import { ScrollView, View } from 'react-native';
import AudioListingHeader from '../../headers/AudioListingHeader';
import { SIZES } from '../../../utils/theme';
import PaathList from '../../lists/PaathList';

const InnerAudioListing = () => {
    return (
        <View className='flex-1' style={{ flex: 1, }}>
            <View>
                <AudioListingHeader />
            </View>
            <ScrollView style={{ flex: 1, }}>
                <View style={{ paddingHorizontal: SIZES.screenDefaultPadding }}>
                    <PaathList punjabiText="ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ " hindiText="हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी " pageInfo="ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ 123" />
                    <PaathList punjabiText="ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ " hindiText="हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी " pageInfo="ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ 123" />
                    <PaathList punjabiText="ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ " hindiText="हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी " pageInfo="ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ 123" />
                    <PaathList punjabiText="ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ " hindiText="हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी " pageInfo="ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ 123" />
                    <PaathList punjabiText="ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ " hindiText="हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी " pageInfo="ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ 123" />
                    <PaathList punjabiText="ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ " hindiText="हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी " pageInfo="ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ 123" />
                    <PaathList punjabiText="ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ " hindiText="हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी " pageInfo="ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ 123" />
                    <PaathList punjabiText="ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ " hindiText="हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी " pageInfo="ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ 123" />
                    <PaathList punjabiText="ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ " hindiText="हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी " pageInfo="ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ 123" />
                    <PaathList punjabiText="ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ " hindiText="हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी " pageInfo="ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ 123" />
                    <PaathList punjabiText="ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ " hindiText="हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी " pageInfo="ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ 123" />
                    <PaathList punjabiText="ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ " hindiText="हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी " pageInfo="ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ 123" />
                    <PaathList punjabiText="ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ " hindiText="हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी " pageInfo="ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ 123" />
                    <PaathList punjabiText="ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ " hindiText="हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी " pageInfo="ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ 123" />
                    <PaathList punjabiText="ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ ਪੰਜਾਬੀ " hindiText="हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी हिंदी " pageInfo="ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ ਪੰਨਾ 123" />
                </View>
            </ScrollView>
        </View>
    )
}

export default InnerAudioListing;
